`timescale 1ns/1ns
module tb_rgb2hsv();

reg [23:0]RGB_888;
wire [23:0]HSV_888;
wire[7:0]h,s,v;

assign h = HSV_888[23:16];
assign s = HSV_888[25:8];
assign v = HSV_888[7:0];

initial begin
	#5;RGB_888 = {8'd0,8'd0,8'd0};
	#5;RGB_888 = {8'd128,8'd128,8'd128};
	#5;RGB_888 = {8'd255,8'd255,8'd255};
	#5;RGB_888 = {8'd255,8'd0,8'd0};
	#5;RGB_888 = {8'd0,8'd255,8'd0};
	#5;RGB_888 = {8'd0,8'd0,8'd255};
	#5;RGB_888 = {8'd255,8'd128,8'd0};
	#5;RGB_888 = {8'd0,8'd255,8'd128};
	#5;RGB_888 = {8'd128,8'd0,8'd255};

//四、ratio 为负数（最容易炸）	
	#5;RGB_888 = {8'd255,8'd0,8'd128};
	#5;RGB_888 = {8'd255,8'd128,8'd0};
	#5;RGB_888 = {8'd0,8'd128,8'd255};
	#5;RGB_888 = {8'd128,8'd255,8'd0};

//五、S ≠ 255（验证除法）
	#5;RGB_888 = {8'd200,8'd150,8'd100};
	#5;RGB_888 = {8'd100,8'd150,8'd200};
	#5;RGB_888 = {8'd120,8'd100,8'd80};
	
//六、工程级随机点（综合检验）
	#5;RGB_888 = {8'd37,8'd201,8'd123};
	#5;RGB_888 = {8'd64,8'd180,8'd200};
	#5;RGB_888 = {8'd90,8'd40,8'd160};

end




rgb2hsv rgb2hsv
(
	.RGB_888(RGB_888),
	.HSV_888(HSV_888)
);

endmodule